{"podcast_details": {"podcast_title": "Long Night in Egypt", "episode_title": "Ep 08: The Book of Maps", "episode_image": "https://megaphone.imgix.net/podcasts/1f1c2ff8-d191-11ec-a36c-63adb9dbc007/image/LNiE-Cover-Art_R1.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Whole Foods Market has the satisfying lunch you're looking for. Level up lunch boxes with Wallet Happy 365 by Whole Foods Market snacks, like organic vanilla animal cookies, organic string cheese, and more. Hey, you have to eat too! Hit the prepared foods department and try the Spicy Red Pepper Salmon. Or treat yourself to pizza from the hot bar. Either way, remember to bring home a Rosemary Lemon Chicken Family Meal for an easy dinner that hits the spot. Shake things up at Whole Foods Market. America's real history was one of giants who overcame all odds, overcame slavers and robber barons. And what did we do? Well, everyone knows we invented the internet, but we also invented the middle class, the five-day work week, the teenager, the automobile, and the space race, and we're just getting started. We've been through far more chaotic times than this one, with some of the most incredible leaders on the planet, and they're ready for us to pick up where they left off. Our real origins connect us back to reality, each other, and a whole new cinematic universe to empower and inspire. My name's Matthew Cook, and I'm the host of American Origin Stories, now playing wherever you get your podcasts, where you can learn more at Realm.fm. Warning. Before we begin, listener discretion is advised, due to adult themes, violent scenes, and language. This series also risks the possibility of you being afflicted with an ancient curse. If you doubt this, ask any member of the production team. Thank you. The Violent Hour presents Long Night in Egypt Long Night in Egypt I've seen nothing. Okay. Thank you. Everything alright, Doctor? The Violent Hour The Violent Hour Oh, God, please. Samira! Samira! Mohamed! Kaila! This is very, very bad. Abbesi? The door is locked. What door? The Pyramid of Unus. The door is locked. What door? The Pyramid of Unus. The door is locked. Right. How is Amir? Sleeping. The doctor gave him another sedative. He was ranting. I'm going to go to the office to get my other key. But that's 45 minutes there and back again. Is there another choice? What about the guards? They won't have the keys. Only I and the director share a set of keys, and the pyramid is closed. Of course. I will be very quick. Do not worry. I know, Samira. I know, Samira. I know, Samira. I know, Samira. This is my daughter. Be strong, my darling. You must have faith. But they went into the pyramid at night. I know. Why didn't we warn them? We could not have known this would happen. We should have warned them. Yes. Please, do not cry. We must, we must stay hopeful. I'm trying. Okay. I am going now. I love you, my darling. My soul. Amr? Hello, this is Samira. Please, leave a message. Samira. If you get this, please call me right away. We're so worried. We know where you went. But we, we hope that... We hope that we're wrong. Please, if you're there... Call me. Hello, this is Samira. Please, leave a message. Hello. My darling. I just... I just wanted to say that... I love you. We love you so much. I'm with Amr at the hospital and he's asleep. He's very upset by what has happened. But you're not in trouble at all. So please don't be afraid to call us. You have seen what happens in the pyramid at night. It is something no one living should ever witness. And... Inshallah you're alive and... And... And we'll be able to tell the tale. Call me, please. Amr. I'm a wake-up. Amr. I'm going to call the doctor. I will not enter the place of destruction. None shall bring me offerings of what the gods detest. Because I pass pure into the midst of the universe. Someone will be here soon. Can I help? Yes. My son. He... He's well. He was thrashing about wildly in the bed. But he is asleep now? He... He was yelling out things. Seems to be very peaceful now. The water was knocked out. No problem. I will send someone to clean it up. Thank you. Is there anything else? Um... No, thank you. I'm sorry. Do not apologize. Someone will be here soon to clean up the spill. Amr. Lay back down. My car is with me. Hello, I'm Samira from the Brasala branch. Where is it? Where is it? Where will it be? Shit! Sonia? Sonia! Yes, Dr. Abbasi? There are keys missing from the safe in Manto's office. What? No! Yes, I need the keys of the Pyramid of Unas. I need them right away! Please wait a moment, sir. I'll try to see if someone has signed them out. Uh, yep, just give me a second. I'm booting up the computer. I have to make a phone call. Can you? Yeah, I'll find the keys and bring them to you. Thank you. Dr. Alcoa? Yes? Oh, wow, it is such a pleasure to meet you. Sorry, you probably haven't got a clue who I am. I'm Rob. I'm one of the British Museum interns. Yes, working with Daniel. Nice to meet you. Welcome. Are you alright? Pardon? Sorry, are you okay? Yes, it's complicated. Is there anything I can do to help? No, no, it's... It will be fine. Just very busy, Zola. Dr. Alcoa? Um, the key was checked out earlier this morning by Mando last night. He's giving a private tour out there today to some people from the French Embassy. No! He can't! He can't! I need you to get in touch with him right away. Tell him he must bring the key to me now. There is an accident. And it's... Well, it's complicated. And I have no time to explain. Tell him he needs to bring the key to the office now. Yes, sir. Right away. Are you sure there's nothing I can do to help? No. Please, do not concern yourself. Right. Well, it was... It was lovely to meet you. Hello? Abassi? Mando has the key. I sent a message for him to bring the key back to me here. I hope he gets your message. I will make sure he does. How is Amr? Restless. Between wake and sleep. But he's quiet right now. Good. Do not say anything to anyone about the pyramid. Of course not. I will call again once I have the key. My demise was granted yesterday. Shhh. I have returned today in my hidden human body. Amr! Amr! I died yesterday and have returned today. Amr! Amr! I died yesterday and have returned today. Abass has been made for me. And I shall go out into the day. And have power over my enemies. Amr Isha. I shall end him. I will take his blood. I will take his knives. And I will not be robbed. Why is this familiar? A great red crown has been given to me. And I go out into the day. Amr Isha. I shall end him. And I go out into the day. Against my enemies. I know what this is. I will eat in a great field upon the altar of Wadjet. Amr. You are possessed by the third eye of Pharaoh Unas. What you saw should have never been seen. I will speak some words to you now. And you will go into a deep rest. When you wake up you will be renewed. Hail to you my dearly beloved Amr. You have appeared in glory like Ra. And behold. He has come to see you and rejoice in you. He has come to see you and rejoice in your beauty. His crown is your crown. His crown is my crown. His crown is my crown. His beauty is your beauty. His heritage is your heritage. His wisdom is your wisdom. His wisdom is my wisdom. His wisdom is my wisdom. He will not die. He will not die. And you will not die. I will triumph over my enemies. Nothing evil will come to pass against him. to pass against him and nothing will come to pass against you forever and ever. The spell is broken. Is everything alright? Yes. Is everything alright? Yes, everything is fine. Do you have the key? I have it. Go quickly. Is Amr still sleeping? He is now. I realize that he was speaking out incantations from the Theban recension of the Book of the Dead, the ones about possession by the Third Eye of Unas. Most likely an effect of what he saw in the tomb. Yes, I was able to pull up an incantation to break the spell on my phone. But he's now in a deep sleep. It will be many hours at least before he wakes up. Come to Sakara. What about Amr? He is asleep and he is safe. Come help me find our daughter. I will call a taxi right away. Masha'Allah. See you soon, habibi. It's a feminist women's history comedy podcast hosted by me, Anne Foster. Hear all the latest scandals from olden times on Vulgar History. New episodes every Wednesday wherever you get your podcasts. I think we should go to the police. No, we mustn't. But they will not understand what has happened. But habibi, Samira is missing. Maybe they can learn to understand. Samira and the others may still be inside the pyramid. And if so, we need to get them out and deal with this ourselves. And what if they aren't inside? Then… I don't know. Wait let me turn on the lights. Samira! Samira! Samira! They aren't in here. Kayla! What were the other two called? Pia and Jordan. Pia! Jordan! Are you in here? Oh god. This is what I feared. My daughter, my only daughter, my life, my soul. Wait. Wait a minute. What is that? What is what? Look. Footprints. Leading into the Sirdeb. Come. Samira! The footprints end here, in the corner. What's that? A book? Is that? It can't be. Flip to the front. Oh my god. The last book of Ahmad Kamil. I never thought I would ever get to see this again. How did it end up here? I can't imagine how. After it was stolen from my grandfather, I assumed it had been sold on the black market. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. I'm not sure. What was it again? I'm not sure. I'm not sure. What was it again? It was, on the black market, and perhaps it was, yet, here it is again, now, in my hands after all these years later. The duwat. The maps and artwork looks just like you always described it. Yes, my grandfather believed that Dr. Kamal went missing in the duwat and drew these maps before knowing he would be stuck there forever. Do you think? No. Unbelievable. It's a depiction of Pia. Being devoured by Eunice. Disguised as a snake. And here is Jordan, falling down into the Duat. A Pia brutally slain. Close the book. Why? If Samira isn't there, I cannot look. But maybe it will show us where she is. You look. I can't. This drawing has Kayla, Moe and Samira standing at the gate to the Temple of Mahat. Oh no. And on the next page, it shows Anumas, weighing Samira's heart. And then, oh my god, Moe. I can't. You were right. You mustn't look. Is she? She's gone. No. We should have warned her. The power of the two. The power of the two. What was that? Moe? Aunt Ronya. Kayla, are you there? Aunt Ronya. They are depicted here as attendants of Unas. What does that mean? They are neither alive, nor dead. They exist. They exist in the realm of the Duat now. Can we extract them somehow? No. You know how the underworld works. Kayla? Moe? We hear you. Speak to us. Are you alright? Moe? They are gone from us. Devoured by Unas. As he became all-powerful. And now, they must serve him for all eternity. The power of the two. The power of the two. What? Hello, my darling archaeology enthusiasts. You are never going to believe where I'm currently headed. It's almost midnight, and we are in a cab heading out to Saqqara to enter the Pyramid of Unas in the pitch black of night. It's super creepy, but super awesome. We must never tell anyone what happened here. And Hamur? He must never say what he saw. But... No one can know. What if we told the police what we believe has happened and they stayed in the pyramid after dark and... And what? They would never believe it. And they too would suffer the same fate as Samira and the others. You're right. Can you imagine what would happen if a journalist or a new station reported on the pyramid after sunset? Thousands of people would flock to witness the Pharaoh make his nightly transformation. The spirits of our ancestors would be subjected to the most horrible disrespect. Someone would attempt to make a lot of money from the nightly visions. And so many people would risk their lives and be killed just for a thrill. No. We cannot let anyone know what has happened here. Put the book in your briefcase. Help me wipe away these footprints. Is that all of them? I think so. Good morning. I'm very sorry but you must leave the pyramid. We are the people of the fallen girl. And in front of... And in front of someone else. They are not here. We have searched the tomb. Search the tomb for anything you can see. Now please, follow me. I need a statement from you. Do you need help getting into the car, my darling? No, I'm fine. You slept for nearly a week. He must be very careful while building back your strength. Sure. Here's your seatbelt. There you go. The president said he was looking forward to beginning talks. In Egypt, the strange disappearance of four American students and one Egyptian national continues to missurvive both authorities and the Egyptian public. On the early morning of March 15th, six young people between the ages of 19 and 21 went into the pyramid of Unas at Saqqara. But it appears that only one came back out. There has been no sign of the other since. Suffering from an acute form of amnesia, Amr Al-Khawar, the 19-year-old twin brother of Sameer Al-Khawar, the missing Egyptian national, was treated with dehydration at Cairo Hospital but has barely been able to give any information to the police. The families of the American students are in shock and disbelief at what has happened to their children and continue to work with the authorities to try and solve the mystery of their disappearance. This morning, police dogs were brought to the scene and more people will be interviewed over the coming weeks. Coming up next on BBC World Service... You've been listening to Long Night in Egypt, a production by Violet Hour Media. It starred... with Lance Roger-Axt as your announcer. Long Night in Egypt was directed and produced by Jack Bowman and written by Sarah Pettah. Dialogue editing was by Lance Roger-Axt. Sound design, sound mixing and mastering by John Piaseki. Music composition was by Tlaib Peshkapea. Executive producer, Cassie Josepha. August is here and summer is winding down, but there's still time for one more great trip. Especially if you come with us on the podcast, Strong Sense of Place. In each episode, we explore a different destination and discuss what makes it special. We talk about the natural landscape, the cultural history and the local food. And then we recommend five books we love that took us there on the page. Ron Charles, book critic at The Washington Post, called our podcast, delightful and charming, and said our show offers the kind of book chat we all crave. Whether you're looking for a beach vacation, a city break, an outdoor adventure or solid company on a road trip, we have something for you. Strong Sense of Place can help you plan your perfect end of summer vacation. So what are you waiting for? Binge more than 50 shows on Apple Podcasts, Spotify and wherever else you get your podcasts."}, "podcast_summary": "In \"Long Night in Egypt,\" a group of young explorers goes missing in an ancient pyramid, leaving their loved ones desperate for answers. As the mystery unfolds, dark forces and ancient curses come to light, threatening not only their lives but the very fabric of reality. With suspense, ancient spells, and a race against time, this thrilling podcast will keep you on the edge of your seat. Tune in to discover the secrets that lie within the pyramid's dark depths, but be warned, the truth may come at a dangerous cost.", "podcast_guest": {}, "podcast_highlights": "- \"Our real origins connect us back to reality, each other, and a whole new cinematic universe to empower and inspire.\"\n- \"Warning. Before we begin, listener discretion is advised, due to adult themes, violent scenes, and language.\"\n- \"A feminist women's history comedy podcast hosted by me, Anne Foster. Hear all the latest scandals from olden times on Vulgar History.\"\n- \"We must never tell anyone what happened here. No one can know.\"\n- \"The strange disappearance of four American students and one Egyptian national continues to mystify both authorities and the Egyptian public.\"\n- \"There has been no sign of the others since. The families of the American students are in shock and disbelief at what has happened to their children.\"\n- \"In each episode, we explore a different destination and discuss what makes it special. We talk about the natural landscape, the cultural history, and the local food.\"\n- \"Whether you're looking for a beach vacation, a city break, an outdoor adventure, or solid company on a road trip, we have something for you.\"\n- \"Binge more than 50 shows on Apple Podcasts, Spotify, and wherever else you get your podcasts.\""}