{"podcast_details": {"podcast_title": "The History of Egypt Podcast", "episode_title": "187: The Abydos King List", "episode_image": "https://megaphone.imgix.net/podcasts/7f77b9bc-b6f6-11ed-8eb6-6b5f270b4f7b/image/show-cover.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Hello, this is Matt from the Explorers Podcast. I want to invite you to join me on the voyages and journeys of the most famous explorers in the history of the world. These are the thrilling and captivating stories of Vigelon, Shackleton, Lewis and Clark, and so many other famous and not so famous adventures from throughout history. Go to explorerspodcast.com or just look us up on your podcast app. That's the Explorers Podcast. Hello folks, Dominic here. In this episode we're going to be discussing the Abydos King List, an important historical record that appears at the Temple of Seti I in Abydos. If you want to read along, you can find the King List on Wikipedia or at the website pharaoh.se. There are links to these websites in the episode's description. Thanks for listening. Salam alaikum and welcome back to the History of Egypt Podcast, episode 187, Seti in Abydos, part 2. Today we continue our journey through Seti's magnificent temple in the holy city of Abydos. We have already visited the outer portions of the monument, including the modern experience when you visit it as a tourist. We have gone through the hypostyle halls, where Seti appears before the gods, and they bless the king and give offerings to him and ensure the prosperity of Egypt. We have visited the Seven Chapels, a unique feature of Seti's temple, in which, rather than one shrine for the household deity, Seti built a whole suite of chapels for different gods and goddesses. We have also visited the Osiris complex, located just behind the seven shrines. This again, unique feature, includes a suite of rooms dedicated to the mysteries, story and worship of Osiris. The King of the Dead, the Lord of Abydos and its cemeteries, Osiris, the foremost of Westerners, was nominally the overlord of this temple, but it's more complicated. Seti did not dedicate this temple specifically to Osiris, but rather to himself as Osiris. The king connected his own memory with that of the King of the Dead. This was not a unique idea. Previous kings had connected themselves with Osiris, especially in their tombs and temples. But Seti took it to a new form in the architectural design, layout and complexity of his monument at Abydos. As a result, the temple of Seti I has a unique architecture, a unique layout, and a special focus on the pharaoh as a representative and member of the divine pantheon. And this idea shapes our understanding of this temple. So those are the basics that we have already covered. Now let us continue our tour. Leaving the Osiris complex, we turn right. We are now heading south, or up river, towards the next major phase of the monument. As you walk south through the second hypostyle hall, you will pass some of the doorways that lead to those seven chapels. On your right as you walk, you will go past Amon-Ra, then Rahorakti, and then Ptah, three of the great creator deities who ruled the major cities of the land. Finally, you will pass the chapel of King Seti himself, a special sanctuary for the pharaoh as a living and eternal being. Seti's chapel includes some beautiful and important imagery, and we'll come back to it later in the tour when it's time to understand the full sequence of rituals and their religious significance. For now, just remember that Seti himself has his own shrine next to the other gods. So you walk through the second hypostyle hall, and pass the doors of the chapels. Eventually, you will come to a pair of doors. In the southern wall of the hypostyle hall, there are two doors, one on your left, one on your right. The one on your right leads to a small, discreet section, with a couple of chapels for additional deities. We will return to this section later in our tour to discuss those gods and their importance. But first, let's visit the part that everybody wants to see. The most famous section of Seti's temple. Taking the door on your left, you enter a long, narrow corridor. It is facing south, and there are several doorways leading off to different rooms and sections of the complex. So architecturally, it's a transitional area, a space between spaces, and not necessarily the most obvious place for an important ritual scene. And yet, the walls of this corridor bear some of the most famous images from the entire Seti temple. When you enter the corridor, you will see the walls to left and right, decorated in elaborate images. To your left, on the eastern wall, hieroglyphs record a series of shrines and temples, which Seti names and honours. We'll come back to those another time. To your right, on the western wall, something different appears. A long scene unfolds along the western wall. There are two parts to it. First, on your right when you enter, a god and goddess appear within their shrine. Standing in front of them, King Seti I and his son, Rameses, make offerings to these gods. The deities include a lioness, Sakhmet, and a falcon. This falcon is Sokar, a lord of the underworld whom we'll meet later. Seti and Rameses make offerings to Sokar and Sakhmet, and apparently these offerings were prodigious. The hieroglyphs describe them, quote, An offering that the king gives for his father, Sokar. One thousand loaves of bread, one thousand jars of beer, one thousand head of cattle, one thousand head of fowl, one thousand lumps of incense, one thousand offerings of oil, one thousand measures of linen, one thousand pieces of clothing, one thousand of wine, one thousand of the gods' offerings, one thousand of offerings, one thousand of fresh vegetables, one thousand of every beautiful and sweet thing, one thousand of every good and pure thing. So at the start of the corridor, the pharaoh and his son make a great offering to Sokar, one of the underworld lords, a god that will help preserve the soul and memory of Seti in eternity. It's a valuable thing to do. But there is more to Seti's offering. Just behind the king and prince, the wall is covered in a long series of texts. Vertical columns and horizontal registers are divided up into separate sections. Each one of these sections contains a cartouche, and within those cartouches you will find the names of kings. This is the Abydos King List. The King List of Abydos is exactly what it sounds like. It is a long list of Egyptian kings, going all the way back to the start of their history. The list is presented in a chronological order, starting with the first king and finishing with King Seti, or the other way around, depending how you read it. The list includes 76 names total. At a glance, it seems to include every king that we know about, and going through the cartouches you will find some prominent and famous names. Figures like Djoser of dynasty 3, Seneferu and Khufu of dynasty 4, Amenemhat and Senusaret of dynasty 12, and Tutmos or Amunhotep of dynasty 18. Superficially it appears to be a full, complete reckoning of the Egyptian monarchs, and yet looks can be deceiving. The Abydos King List, commissioned by Seti I, actually includes many gaps, where kings have been omitted or ignored for various reasons. We'll explore that in more detail later in the episode. But at the outset, Seti's King List appears to be a complete record, but it is actually anything but. The list has 78 names total, going from the first king of Egypt, all the way up to Seti. I won't read every single name, but I will go through it chronologically. We will look at the various periods of Egyptian history, and see how Seti's record lines up with the version that archaeologists and historians have been able to reconstruct. We will also see the places where Seti, or his compilers, have left significant gaps or omissions in the historical lineage, places where they ignored or left out certain monarchs. At the end, we will look at the King List overall, and how it fits into the larger temple, and see what all of this tells us about Seti's religious and political priorities. Finally, one quick note before we embark. Seti's King List appears as a continuous series of names. There are no gaps or breaks to indicate dynasties or different historical periods. That may sound strange. We talk about the 19th dynasty, the 1st dynasty, the 4th dynasty, and we speak about the Old, Middle, and New Kingdoms. Those are modern historical conveniences. They are based on older traditions, but for the most part, Egyptologists and historians use these for convenience. The ancient Egyptians seem to have viewed their kings as a continuous unbroken line stretching back into history. Occasionally, they make references to different families or households or even periods of history, but overall, the idea was definitely continuity. As a result, Seti's King List appears as a single series of names. I will reference the dynasties and historical periods, but that is just for convenience. Now then, let's begin. The Abydos King List, the top 76 pharaohs, as presented by Seti I. Seti's King List begins more than 1700 years earlier, with the first ruler of a unified Egypt. Seti records this name as Meni. Meni, or Menes, is an interesting figure. He is mentioned in other sources for Egyptian history, most notably the Greek authors, but we don't actually have any monuments or records that mention this individual. Scholars suspect that Meni is probably another name for Namer, the first archaeologically attested king of a unified Egypt, episode 1. But the name Namer does not appear on the Abydos King List. Instead, Seti remembers the first ruler as a man named Meni. The name Meni might be an epithet. The word itself comes from the verb men, meaning to establish or to endure. In English, a name like Meni could perhaps translate as something like the Establisher or the Founder. So it might not be a historical name, but rather an epithet, a memory of the ruler who founded the kingdom. The point is, Seti begins with Meni. Historians tend to begin with Namer, but they might be the same person. This phenomenon of slightly different names for individual rulers actually carries on, especially during the early dynasties. The second king, for example, is named Teti, but this is probably another name for Horus Ahah, the second king of the country attested in the archaeology. The third and fourth are called Iti and Ita, which are probably the kings Jer and Jet. So apparently Seti and his record keepers had access to slightly different versions of these individuals. Maybe the spelling had changed over the centuries as the Egyptian language evolved, or maybe the kings themselves had developed reputations and been called by different names according to historical memory. The point is, the earliest dynasties, as far as Seti records them, are quite different from the ones we know about in archaeology. After Jer and Jet, we get our first omission, our first gap in the record, where we know somebody existed, but Seti does not include them. Following Jer and Jet, the king list skips straight to Den, but there should be another name between those, the name Mernith. Mernith, or Merenith, was a woman who seems to have ruled as a king during the first dynasty of pharaohs. Pharoahs have recovered items referencing this ruler, and we know she existed, and yet Seti's king list does not include her. We will see this happen again in later parts of the list, but it seems like for Seti and his compilers, woman pharaohs were not considered legitimate. So that's our first omission. There will be more. Moving on, the king list continues through the first and second dynasties. Many of these kings are presented with different spellings than the versions we get from archaeology. For example, Horus Ka appears as Kebech, and Khasa Kemwi appears as Jadja'i. It's not clear why this spelling deviates in this way. It's possible that Seti's record keepers had a different version of these kings' identities. Perhaps in some cases, these are their genuine personal names. A king might rule as Khasa Kemwi, but perhaps in day-to-day life, everybody knew him as Jadja'i. Another explanation could be that these kings had been sort of forgotten. The gap between the Abydos king list and the version found in the archaeological record, that gap is largest for dynasties 1 and 2. It is possible that 1700 years after that period, the Egyptian record keepers had lost some of the details about the earliest monarchs. Perhaps they recorded these names with epithets or phrases associated with those rulers, even if they did not officially know their names. The point is, Seti's version of the first and second dynasties is quite different from the archaeological material. Maybe that period had been forgotten. Now we come to dynasties 3 and 4, the start of the Old Kingdom. At this point, Seti's king list starts to become more reliable, or at least more recognisable. In dynasty 3 for example, we have the king Djoser or Djoser T, a famous monarch who commissioned the steppe pyramid, episode 4. Again, this one is slightly different from its historical version. In his own time and on his monuments, this ruler is universally called Netjaddi Khet, but later traditions have changed his name to Djoser, which means something like the sacred one. Perhaps over the centuries, his reputation had grown, and as the steppe pyramid towered over the skyline of Memphis, people may have come to view this ruler as a truly divine figure. Ironically, the name Djoser has superseded Netjaddi Khet as the name by which this monarch is known, so maybe popular tradition really did supersede the historical version. Still, for the builder of the steppe pyramid, the Abydos king list gives us Djoser. Moving on, we start to encounter kings of the 4th dynasty, and these names are very recognisable. The first of them is Senetheru, the powerful monarch who commissioned three pyramids at Maedum and Dashur, episode 5. Then we have Senetheru's son, spelled Khufu or Khufu, the man who commissioned the Great Pyramid at Giza. Next we have Khufu's successor, a little-known king named Jeddethra or Rajedeth, episode 7. And finally we have Khafra and Menkaura, who built the 2nd and 3rd pyramids and the Great Sphinx at Giza, episodes 7 and 8. With that, we come to the point where historians divide between the 4th and 5th dynasties, with the monarch Shipses Khaf. Here there might be another omission. At the end of the 4th dynasty, a royal woman named Kentikaos may have acted as the regent or even king of Egypt, episode 9. Her name does not appear on the Abydos king list, but that one might be legitimate. We are not sure on Kentikaos' exact role, she may have acted as a king, but it's possible she was just a powerful political figure, not an anointed monarch. We'll give Seti the benefit of the doubt, but Kentikaos' absence is noticeable. From here the list moves into dynasties 5 and 6. At this point the Abydos king list is remarkably consistent with the archaeological and historical record. We have the names of Ussurkhaf, Sahura, Nefaiakara, who is called Kakai, Nefaefra or Raneferef, Nyusra, Jedkarei and Unas. They are the legitimate kings of that period, and Seti seems to present them in a complete record. The same is true for dynasties 6. We get Teti, Ussukhara, Merira or Pepe I, Merenra and Nefakara or Pepe II. These names seem to appear in the legitimate order, but after that the Abydos king list does something interesting. It includes a whole list of names from the late Old Kingdom, about whom scholars know almost nothing. This includes figures like Necherkara, who might be the mysterious queen Nitikreti or Nitocris, but after that it includes a bunch of additional names who are quite mysterious, like Nefakara Nebi, Jedkara Shemai and Seneferkha. These kings have left so few records that in some cases they are just names on the list, no other information. There are 17 of these shadowy late Old Kingdom rulers, from number 40 to number 56 on the king list. So apparently Seti I and his chroniclers worked from a record that was far more complete for certain historical phases. This is an interesting feature of the Abydos king list. It frequently omits individual rulers or even entire periods, but then it includes a list of names for whom the archaeological and historical evidence is practically nothing. Obviously this is a major challenge for historians. Scholars want to know who these individual rulers are and what their relative positions were at the end of the Old Kingdom, but when so many of the names on the Abydos king list are completely lacking in other sources, it's almost impossible to paint a comprehensive picture. As you can imagine, Seti's king list has been a serious headache for Egyptologists and historians for over a century. So the Abydos king list includes a bunch of shadowy rulers from the end of the Old Kingdom, a period that historians term Dynasty VIII. After that though, it does something interesting. Having listed the shadowy kings of the late Old Kingdom, the list suddenly skips ahead to the very start of the Middle Kingdom. In other words, the Abydos king list completely leaps over the first intermediate period, that time of disunity and maybe civil war that followed the end of the Old Kingdom. The first intermediate period is an important phase in Egyptian political history, but Seti's record keepers completely ignore it. They go from one period of unity to the next. Anything in between is omitted. This gap deepens our understanding of what Seti is trying to do. He is not making a factual, accurate historical record. Instead he is making a list of the legitimate rulers as he perceives them. The Egyptian kingship as a concept is built on the idea of unity, unifying the two halves of the country and banishing the forces of chaos. Seti includes the rulers whom he or his record keepers perceive as legitimate in the sense of ruling a unified Egypt. Those who did not, those who ruled a disunited Egypt, they are omitted. To be fair, it is possible that some of those records had also been lost, like the first and second dynasties. A period of disunity and civil conflict was not exactly conducive to good record keeping, and there might be legitimate gaps or oversights in the record Seti was using. But since the king list is largely accurate through dynasties 3, 4, 5, 6 and even 8, it seems more likely that the first intermediate period is omitted for a political reason. This is reinforced by the next figure whom Seti chooses to include. Having finished the 8th dynasty, Seti's list now jumps to the name Neb Chepedra, a king whom we call Montu Hoteb II. Montu Hoteb II is a famous ruler, and his presence on the king list is justified. This monarch was apparently responsible for the reunification of Egypt at the end of the first intermediate period. So it's understandable that Seti's compilers skip ahead to this next legitimate ruler, but it's an interesting feature of the king list that an entire historical phase, with some genuinely interesting figures, is completely ignored. This will happen again and affect some truly famous rulers. We will continue our exploration of the king list in just a moment, as Seti deals with the Middle Kingdom, the second intermediate period and the time of the Hyksos, and the great rulers of dynasty 18, including some of those controversial names. That is after the break. See you in a moment. Howdy folks, Dominic here, with a quick word about the sponsor for this episode. Meal kits by HelloFresh are a great way to introduce variety to your diet. Every week, HelloFresh offers more than 40 chef-crafted recipes, with plenty of options for family-friendly or those focused on health and fitness. With pre-portioned ingredients, easy step-by-step recipes, and parcels delivered right to your door, it is easy to balance healthy eating with your lifestyle. My partner and I have used HelloFresh many times, and the experience is always positive. We can tailor meal packs to our tastes, we like spicier food than usual, and the portions are generous. HelloFresh meal kits take the hassle out of planning and organizing food, and it's much healthier on the waistline. Right now, HelloFresh is making a special offer for History of Egypt podcast listeners. Go to hellofresh.com slash 50 Egypt and use code 50EGYPT for 50% off plus free shipping. That's 50% off. Just visit hellofresh.com slash 50EGYPT and use the code 50EGYPT. See why HelloFresh is America's number one meal kit, and start enjoying a healthier routine today. Hi everyone, this is Scott. If you want to learn about the world's oldest civilizations, find out how they were rediscovered. Follow the story of Mark Antony and Cleopatra's descendants over ten generations, or take a deep dive into the Iron Age or the Hellenistic era, then check out the Ancient World podcast. Available on all podcasting platforms, or go to ancientworldpodcast.com. That's the Ancient World podcast. Following the Old Kingdom, the list now jumps to the ruler Montu-Hotep II, whom history explains as the first monarch of the Middle Kingdom. At this point the list starts to become more reliable once again, but as usual, there are interesting gaps and omissions. Following Montu-Hotep II, we get his successor, Sankh-Kha-Rai, also known as Montu-Hotep III. Then the King list does another little jump. It ignores the reign of Montu-Hotep IV, a king whom we met in episode 31. Montu-Hotep IV was a legitimate ruler and we know a lot about his reign. So why does Seti ignore him? Well, it seems that Montu-Hotep enjoyed a poor reputation. Another King list, compiled not long after Seti's, records the time of Montu-Hotep IV as a period of seven empty years. That is, seven years when there was no king. The reasons for this are debated, but the result seems clear. By 1300 BCE, approximately, Egypt's pharaohs and their record keepers considered that ruler to be less than legitimate. So the Abidos King list skips from Montu-Hotep III, ignores Montu-Hotep IV, and goes straight to the next ruler. A man named Sehetep-Ibra or Amenemhat I, the first ruler of dynasty 12. Amenemhat I may have been responsible for the downfall of Montu-Hotep IV. Again, historians debate what exactly happened here, but we do know that Amenemhat took over the throne of Egypt, and his family became the next ruling dynasty. At this point, the list returns to a period of stability. The next series of names are well-attested and well-recorded. Senusaret I, Amenemhat II, Senusaret II, Senusaret III, Amenemhat III, Amenemhat IV. All the great kings of the 12th dynasty, whom we met in episodes 32 to 48. God, did I cover the entire Middle Kingdom in like less than 20 episodes? Damn. So the Abydos King list recognizes dynasty 12 as a period of legitimate stability and unity, and pretty much every king is included. At least up until the end. At the end of dynasty 12, archaeologists know about a king named Sobek-Netheru or Neferu-Sobek. Neferu-Sobek, whom we met in episode 50, is actually a woman reigning as a king. Like Merenith from dynasty 1, she is excluded from the Abydos King list. Apparently, Seti's record keepers did not consider this female pharaoh to be legitimate, and so after Amenemhat IV, her name is absent. The same is true for a group of rulers who came after the 12th dynasty, but who did not rule a unified Egypt. During the Second Intermediate Period, from approximately 1750 to 1550 BCE, Egypt was once again disunified. The land of the Nile was broken up into a series of smaller kingdoms, of varying sizes and importance. Archaeologists know a lot about these individuals, like the 17th dynasty, including the rulers Sekhenenra-Tau or Khamoza, who led important campaigns and left significant archaeological records. But Seti's king list does not include Sekhenenra or Khamoza, because they did not rule a unified country. They were important, especially in the south, but they did not succeed in bringing Egypt back to its essential unity. Naturally, the list also omits the Abydos dynasty, a shadowy group of rulers that historians are only recently beginning to understand and learn more about. The Abydos dynasty has not appeared in this podcast yet, because the information is still very young. One of their kings, named Senebkhai, was only discovered and identified in 2014, so there may be an entire group of rulers local to Abydos who existed during this period. But they did not control the whole country, so Seti omits them. Naturally, Seti also does not include the Hyksos, the Hykha-Khasut, or rulers of foreign lands, a series of kings of Canaanite or Syrian descent who seem to have emerged as an independent kingdom at the end of the 12th or 13th dynasties. The Hyksos kings, who ruled the north of Egypt, are a fascinating group, and over the past 10-15 years, there has actually been a massive push among Egyptologists to start uncovering and publishing more of the material related to these figures. The result has been a massive uptick in our understanding of the Hyksos, and I actually want to go back and redo the entire second intermediate period so that I can fully embrace that new information and the nuances that come with it. Alas, as far as Seti is concerned, the Hyksos rulers and those of the south like Sakenenra, they do not count. The list jumps 200 years, from the end of dynasty 12 to the start of dynasty 18. Following the cartouche of Amenemhat IV, the next cartouche, number 66 on the list, is Nebh-Pekhtira, that is Amoza. The first ruler of the 18th dynasty, and the new kingdom. Again, the Abydos king list moves into a stable historical period, and the names for this section are mostly consistent with what we know, but there are some important exceptions. After Amoza, we get the next king, Jassacara, or Amonhotep I. We get Aakepekara, Thutmose I. Aakeprenra, Thutmose II. Then we get a jump. After Thutmose II, the next cartouche is Menkepera, Thutmose III. Historically there should be a name in between these, Maatkara, or Hatshepsut. Alas, Seti does not consider Hatshepsut, a woman, to be a legitimate part of the pharaonic lineage. So, she is excluded. The same is true for the Amana period. After the name of Amonhotep III, Neb Maatra, the next cartouche is Josur Keperura Setependra, that is King Horemheb, a man who reigned at least 35 years after Amonhotep III. The Abydos king list completely ignores the rulers Akanaten, Tutankhamun, Smenkkaurei, or Ank Keperura, and King I. This sequence of rulers are entirely omitted, and over 30 years of political history are deleted from the official record. Apparently, Seti I and his record keepers considered Horemheb to be the legitimate successor of Amonhotep III. Everything in between was forgotten. Of all the gaps in the Abydos king list, this one might be the most interesting. For periods like Dynasty I and II, we can sort of forgive Seti for maybe not having access to those records. After 1700 years, things may simply have been forgotten. Likewise, for the first and second intermediate periods, there is a genuinely understandable priority. The country was disunified, and its rulers did not govern the entirety of Egypt. So from a political or even religious perspective, those monarchs, while influential, did not necessarily count as kings of the two lands. Maybe a small part of it, but not the whole country. The same is true for the female rulers, Merynith, Sobekneferu, Hatshepsut. They did not fit for conceptual and physical reasons. One of the core ideas of the Egyptian monarch was that they were the male offspring of a god, the son of Ra or the son of Osiris. So the idea of a female king simply didn't fit the paradigm. Even if those rulers were effective, they were not necessarily kings of the two lands. So for those other periods, the early dynasties, the intermediate periods, the female rulers, we can understand the omissions because of what those rulers lacked. A lack of memory, a lack of unity, a lack of testicles. But the Amarna period is different at the time. They were legitimate rulers. They inherited authority from their parents, and they governed the realm as the kings of the two lands. So there has to be another reason why they are omitted. Why does the list go from Amunhotep III straight to Hormheb? That is the million dollar question of the Amarna period. There are many reasons why later generations might consider Akhenaten, Nefertiti, Tutankhamun, or even Ai to be less than legitimate pharaohs of the old order. The religious angle is the obvious one. Akhenaten particularly had been responsible for serious changes, even damage, to the old religious system. A few decades later the backlash may have been in full swing, a desire to forget that period and to completely ignore the heresy, quote unquote, of that fanatical ruler. If you take the religious angle, then Akhenaten's insanity may have tarred and besmirched the reputations of his successors. Tutankhamun had originally been Tutankaten, a son and successor of Akhenaten's ideas. Nefertiti, of course, had been central to Akhenaten's court and probably been involved in many of his decisions. Finally, King Ai had been the last member of that old ruling order. Whether he was a member of their family or simply a well-connected courtier, he was perhaps the last symbol of that generation. So just looking at the religious angle, that might explain the omission. If all of those monarchs were associated with the changes and damages to the temples and the gods, that might be enough to remove them from the record. But we should also consider the political angle. After the death of King Ai, the next ruler was Joseph Keperura Horemheb, the monarch whose name appears right next to Amunhotep III. This is important. It was Horemheb that chose Ramesses I and Seti I to be the next kings of Egypt. He was their patron. It was thanks to Horemheb that the 19th dynasty took hold. Horemheb's reign is noteworthy for his revisions to recent historical events. We explored these in greater detail during his reign. But long story short, Horemheb had promoted a new vision of recent history. One that promoted himself and justified his claim to be the new pharaoh. So if you look at it from a more political perspective, that could be another factor influencing the omission of the Amarna period. Horemheb had put great effort to present his regime as a new legitimate successor to Amunhotep III and the great monarchs of the 18th dynasty. That perspective must have influenced Ramesses I and Seti I. After all, they were the beneficiaries of Horemheb's angle. So those political perspectives may have been another factor that influenced this decision. To remove the Amarna rulers and present Horemheb as the direct successor to Amunhotep III. But of course, that political explanation does not fully explain why the Amarna rulers were considered illegitimate. Even if Horemheb had wanted to associate himself with Amunhotep III, there had to be another reason why that previous family was discredited and removed. There may be other reasons that have been lost to time, and no doubt, future scholarship will add more nuance to this portrait. But considering what we know about recent history, the religious explanation does seem the most likely. Akhenaten and his successors were omitted because they had lacked piety, a proper respect for all the deities of Egypt and appropriate performance of their divine duties. So if we are looking at the Abydos king list overall, in particular the gaps, we might explain those omissions in terms of lacking. A lack of knowledge for the first and second dynasties, a lack of authority and unity for the intermediate periods, a lack of masculinity for the female rulers, and a lack of piety for Akhenaten and those associated with him. Considering the names of Amunhotep III and Horemheb, the last two cartouches, numbers 75 and 76, are Men Pachtira, Ramesses I, and Men Ma'atra, Seti I. With that, the chroniclers of Abydos have reached the present day, and the king list finishes with the name of Seti. Going chronologically, the Abydos king list provides a fascinating perspective on Egyptian kingship. Reading the list from start to finish, you get a sense of the long continuity of the pharaonic household. And also you get an idea of Ramesses and Seti as the ultimate incarnations of that legacy. They are the ones who carry the legacy of the royal ancestors, at least the legitimate ones. That legacy is presented as a single unbroken line. Again, there are no markers for dynasties or historical periods on the Abydos king list. And the gaps or omissions are ones that historians know about. They do not appear physically on the wall. So as far as the official record is concerned, the line of Egyptian monarchs was a single unbroken lineage. And Seti honours that on the walls of his temple. So we've gone through the king list itself and discussed the names and some of the interesting historical features. But let's cycle back to the important question. Why is this king list here? Why did Seti commission it? Why did his record keepers put it on the walls of the temple? What exactly is its function? First, the king list is functional. It immortalises the names of the legitimate rulers, and it guarantees that their memory persists. For the Egyptians, the survival of your name was a crucial part of one's immortality in the next life. So in that sense, Seti is making a memorial for his royal ancestors. He is also making an offering. The Abydos king list is here to guarantee that every royal ancestor will receive offerings from the temple. This is conveyed in the hieroglyphs which surround the king list itself. Besides the cartouches of the actual kings, there are a series of prayers and invocations by Seti I. For example, some of the phrases include, Speech by the king Men Ma'atra, Bringing food to the god, Depositing an offering for the kings of southern and northern Egypt, the royal ancestors. The offering includes, A thousand bread, a thousand beer, a thousand cattle, a thousand fowl, a thousand incense, a thousand ungulant or cosmetics, a thousand linen, a thousand cloth, a thousand wine, and a thousand of the divine offering, as the gift of the king Men Ma'atra. So the list is here partly so that Seti can give offerings to the royal ancestors. He records their names so that each one of them can receive their proper share of sacred food, drink, and supplies. This is further emphasized when above every single cartouche there is a short text saying, For the king with their cartouche, and below there is another phrase saying, As the gift of King Men Ma'atra or Seti I. So the list is here to remember the legitimate rulers and to ensure that their souls, their spirits receive offerings from the temple. That gives the list its basic daily function. Seti I or his priests can bring offerings from the great sanctuary and honor the royal ancestors. Doing that, they will naturally ensure each and every one of those kings enjoys energy and happiness in the afterlife. The fact that Seti's own name appears in this list also helps to guarantee he will enjoy those in the distant future. Beyond that daily, practical function, there is also a larger cosmic purpose. This has to do with the idea of Ma'at, a philosophical concept that we can translate as order or truth. Basically, Ma'at is the way things should be, the natural order of the universe that the gods created in which they dictate. Every pharaoh was bound to uphold Ma'at, to maintain the balance of the cosmos, and to ensure that chaos did not take over. One of the ways that a king could do that was through the preservation and transmission of writing. Writing was the great tool of the Egyptian state and their religious order. Writing preserved memory, it enabled greater organization, and it helped communicate ideas across distances and time. For the ancients, the use of writing, especially hieroglyphs carved in stone, was a tool of preservation, and thus an act of maintaining Ma'at. From that perspective, Seti's king list has a greater cosmic function. It is not just a statement of political or religious history, it is itself a ritual, an act of maintaining Ma'at and preserving the divine order. In a sense, the Abydos king list is not just a record, but also a promise and a guide, a way for future generations to make the proper offerings to the ancestors. In the previous part of our tour, we saw how the seven chapels within Seti's temple help record the daily rites and rituals of the gods. Well, the Abydos king list does something similar. It shows a reader how to properly honor the names and memories of the ancestors. And by doing that, it helps the reader to maintain the cosmic continuity, the lineage of kings who kept Egypt unified. There is a lot more that I could say about the Abydos king list, both its visual appearance and the context in which the list is presented. But for now, we will have to leave things here. Thank you for listening to the History of Egypt podcast. Next week, we continue our tour and we explore one of the most famous and curious aspects of Seti's temple. Out the back of the monument, there is a deep pit, filled with stone and containing interesting texts. Next time, we explore Seti's Osirion. If you've enjoyed this episode and you're interested in the Abydos king list, I do have a recommendation for you. The artist Natalie Watson of Wonderful Things Art has made a full scale, full color reproduction of the Abydos king list. Natalie uses scholarly texts and publications of ancient monuments to reconstruct their original appearance. In many cases, scholars have been able to identify traces of color on the walls of temples, and Natalie uses those to bring the hieroglyphs and figures back to life. Her work is delightful and I highly recommend checking it out. You can see the reproduction and many other projects at Natalie's website, wonderfulthingsart.com. I'll put a link in the episode description. I'm not receiving any commission for this, I just really like her work, so if you appreciate the Abydos king list, check out Wonderful Things Art and see the fabulous reproduction. That's all from me, on to the next episode. Take care and may your ancestors bless you and appreciate your efforts. Hi I'm Matt Albers, host of the Pirate History Podcast. The men and women of the Golden Age of Piracy are some of the most infamous and often misunderstood characters in all of human history. You know their names, Anne Bonny, Henry Avery, Mary Reed, Captain Kidd, Blackbeard, but do you know their stories, their real stories? Every week over on the Pirate History Podcast we examine what made these pirates sail the high seas in search of plunder and adventure and revenge. If you'd like to hear the stories of the real men and women who went on the account and sailed under the black flag, join us on the Pirate History Podcast."}, "podcast_summary": "Join Matt from the Explorers Podcast as he takes you on thrilling voyages and journeys, uncovering the captivating stories of famous and lesser-known explorers throughout history. Tune in to the Explorers Podcast for riveting tales of adventure. And if you're a history buff, don't miss the History of Egypt Podcast's fascinating exploration of Seti's Temple in Abydos. In this episode, Dominic takes you on a tour of the temple, delving into the significance of the Abydos King List. Discover how this ancient record immortalizes the names of Egyptian pharaohs, ensuring their memory and receiving offerings in the afterlife. Uncover the omissions and gaps in the list, shedding light on the religious and political priorities of Seti I and his record keepers. Experience the rich symbolism and cosmic significance of the Abydos King List, a powerful testament to the preservation of the divine order in ancient Egypt. Don't miss out on this intriguing episode of the History of Egypt Podcast.", "podcast_guest": {"Shackleton": "Major Sir Ernest Henry Shackleton  (15 February 1874 – 5 January 1922) was an Anglo-Irish Antarctic explorer who led three British expeditions to the Antarctic. He was one of the principal figures of the period known as the Heroic Age of Antarctic Exploration.\nBorn in Kilkea, County Kildare, Ireland, Shackleton and his Anglo-Irish family moved to Sydenham in suburban south London when he was ten. Shackleton's first experience of the polar regions was as third officer on Captain Robert Falcon Scott's Discovery expedition of 1901–1904, from which he was sent home early on health grounds, after he and his companions Scott and Edward Adrian Wilson set a new southern record by marching to latitude 82°S. During the Nimrod expedition of 1907–1909, he and three companions established a new record Farthest South latitude at 88°S, only 97 geographical miles (112 statute miles or 180 kilometres) from the South Pole, the largest advance to the pole in exploration history. Also, members of his team climbed Mount Erebus, the most active Antarctic volcano. For these achievements, Shackleton was knighted by King Edward VII on his return home.\nAfter the race to the South Pole ended in December 1911, with Roald Amundsen's conquest, Shackleton turned his attention to the crossing of Antarctica from sea to sea, via the pole. To this end, he made preparations for what became the Imperial Trans-Antarctic Expedition, 1914–1917. Disaster struck this expedition when its ship, Endurance, became trapped in pack ice and was slowly crushed before the shore parties could be landed. The crew escaped by camping on the sea ice until it disintegrated, then by launching the lifeboats to reach Elephant Island and ultimately South Georgia Island, a stormy ocean voyage of 720 nautical miles (1,330 km; 830 mi) and Shackleton's most famous exploit. In 1921, he returned to the Antarctic with the Shackleton–Rowett Expedition, but died of a heart attack while his ship was moored in South Georgia. At his wife's request, he was buried there. The wreck of Endurance was discovered just over a century later.Away from his expeditions, Shackleton's life was generally restless and unfulfilled. In his search for rapid pathways to wealth and security, he launched business ventures which failed to prosper, and he died heavily in debt. Upon his death, he was lauded in the press but was thereafter largely forgotten, while the heroic reputation of his rival Scott was sustained for many decades. Later in the 20th century, Shackleton was \"rediscovered\", and became a role model for leadership in extreme circumstances.In his 1956 address to the British Science Association, Sir Raymond Priestley, one of his contemporaries, said \"Scott for scientific method, Amundsen for speed and efficiency but when disaster strikes and all hope is gone, get down on your knees and pray for Shackleton\", paraphrasing what Apsley Cherry-Garrard had written in a preface to his 1922 memoir The Worst Journey in the World. In 2002, Shackleton was voted eleventh in a BBC poll of the 100 Greatest Britons.", "Lewis and Clark": "The Lewis and Clark Expedition, also known as the Corps of Discovery Expedition, was the United States expedition to cross the newly acquired western portion of the country after the Louisiana Purchase. The Corps of Discovery was a select group of U.S. Army and civilian volunteers under the command of Captain Meriwether Lewis and his close friend Second Lieutenant William Clark. Clark and 30 members set out from Camp Dubois (Camp Wood), Illinois, on May 14, 1804, met Lewis and ten other members of the group in St. Charles, Missouri, then went up the Missouri River. The expedition crossed the Continental Divide of the Americas near the Lemhi Pass, eventually coming to the Columbia River, and the Pacific Ocean in 1805. The return voyage began on March 23, 1806, at Fort Clatsop, Oregon, and ended on September 23 of the same year.\nPresident Thomas Jefferson commissioned the expedition shortly after the Louisiana Purchase in 1803 to explore and to map the newly acquired territory, to find a practical route across the western half of the continent, and to establish an American presence in this territory before European powers attempted to establish claims in the region. The campaign's secondary objectives were scientific and economic: to study the area's plants, animal life, and geography, and to establish trade with local Native American tribes. The expedition returned to St. Louis to report its findings to Jefferson, with maps, sketches, and journals in hand."}, "podcast_highlights": "1. \"Join me on the voyages and journeys of the most famous explorers in the history of the world.\" - Explorers Podcast\n\n2. \"We're going to be discussing the Abydos King List, an important historical record that appears at the Temple of Seti I in Abydos.\" - History of Egypt Podcast\n\n3. \"Seti took it to a new form in the architectural design, layout, and complexity of his monument at Abydos.\" - History of Egypt Podcast\n\n4. \"The walls of this corridor bear some of the most famous images from the entire Seti temple.\" - History of Egypt Podcast\n\n5. \"Seti's offering: one thousand loaves of bread, one thousand jars of beer, one thousand head of cattle, one thousand head of fowl...\" - History of Egypt Podcast\n\n6. \"The Abydos King List, commissioned by Seti I, includes many gaps, where kings have been omitted or ignored for various reasons.\" - History of Egypt Podcast\n\n7. \"The Abydos King List is a long list of Egyptian kings, going all the way back to the start of their history.\" - History of Egypt Podcast\n\n8. \"The ancient Egyptians seem to have viewed their kings as a continuous unbroken line stretching back into history.\" - History of Egypt Podcast\n\n9. \"The Abydos King List guarantees that their memory persists and ensures each one of them receives their proper share of sacred food, drink, and supplies.\" - History of Egypt Podcast\n\n10. \"The Abydos King List is not just a record, but also a promise and a guide, a way for future generations to make the proper offerings to the ancestors.\" - History of Egypt Podcast"}