{"podcast_details": {"podcast_title": "Egypt Travel Podcast", "episode_title": "May/June 2023 GEM Updates", "episode_image": "https://egypttravelblog.com/wp-content/uploads/2023/05/new-cover-art-1.jpg", "episode_transcript": " Hi, everybody. It's John Navarre here with sort of a special announcement about an important announcement, or at least an important update. I know that a new episode of the Egypt Travel Podcast with a comprehensive update about the current status of the Grand Egyptian Museum is long overdue. And I finally have that update ready for you. In the 38th episode of the Egypt Travel Podcast, I do a deep dive into the latest updates on the GEM as of May and June of 2023, including detailed information on the GEM's new limited trial visits program, what's available to see and what's off limits during these trial visits, and most importantly, how to get tickets if you happen to be in Egypt before the GEM fully opens to the public. And of course, I give you an update on when that might be, according to the latest indications and estimates. But I've got a favor to ask of you in exchange for putting a lot of time and effort into researching, recording, producing, and editing this meaty and timely update about the GEM for you, a favor that I think you'll actually get a lot out of yourself too. So this latest episode of the Egypt Travel Podcast about GEM updates for the summer of 2023 is actually another video podcast episode. And on top of that, I've transitioned the video podcasts and all of the video that I'm going to be doing now moving forward to the new YouTube channel that I've launched. It's called the Egypt Travel and Culture Channel on YouTube. And the handle for it is at, you know, the little at symbol, at Dreaming of Egypt, which means that the easy to remember website address for it is youtube.com slash at Dreaming of Egypt, the at symbol, you know, like in the email, the at symbol, youtube.com slash at dreaming of Egypt. I'll actually explain later this year why the new YouTube channel uses that handle, dreaming of Egypt. But just to give you all loyal listeners a little hint way in advance, it might have something to do with a new behind the scenes show coming later this year about what it's like to run a tour operator on the ground here in Egypt every day. But I'll talk more about that later when that project is a little further along. For now, if you'll head over to youtube.com slash at dreaming of Egypt, and I'll put a link in the show description here too, by the way, then you'll be able to find the full video podcast episode that I just put out today with a lot of substantive updates on the Grand Egyptian Museum. And while you're there, please do me that huge favor and subscribe to the new channel on YouTube and click the little bell there on the page so that you can get automatic notifications when I release a new audio or video episode of the Egypt travel podcast, which is also now being posted there on the YouTube channel too. So just to wrap up, here is the favor I'm asking again for anyone interested in the latest video episode of the Egypt travel podcast about spring and summer updates on the Grand Egyptian Museum. Go to youtube.com slash at dreaming of Egypt. The link is below or you know what? You can just go to YouTube and search for either dreaming of Egypt, John Navar and make sure you put my name in there by the way, so that all the weird stuff doesn't come up first about having dreams of being a Pharaoh. Dreaming of Egypt, John Navar search for that or you can just put in the channel's name, the Egypt travel and culture channel and put my name too with it just to make sure John Navar. And you'll find both the new YouTube channel that I just launched and on that channel, the latest video episode of this podcast, which is entitled May slash June, 2023, Jim updates. You'll know it because you'll see my face in the thumbnail there of the video. All right, I'll leave you to it now to go watch that episode and subscribe to the channel so that you get notified of all the new video episodes I've started recording and producing at our new recording studio here in the Egypt elite office here in Cairo. And if anyone has questions for me, please, please feel welcome to post them in the comments on the video and I'll answer them immediately. I'll get notified of the questions immediately and I'll be able to answer them there right there on the page so that other people can benefit from the answers that I'm giving. Okay everyone, see you over on YouTube for this episode on May, June, 2023, Jim updates and a lot more soon. Bye-bye."}, "podcast_summary": "In the latest episode of the Egypt Travel Podcast, John Navarre provides a comprehensive update on the Grand Egyptian Museum. He discusses the limited trial visits program, what visitors can expect to see, and how to get tickets. There is also speculation on when the museum will open to the public. This episode is available as a video podcast on the new YouTube channel called \"Egypt Travel and Culture Channel.\" John asks listeners to subscribe to the channel and provides a hint about an upcoming behind-the-scenes show. To watch the episode, visit youtube.com/atdreamingofegypt. Don't miss out on this informative and exciting update on the Grand Egyptian Museum.", "podcast_guest": {}, "podcast_highlights": "1. \"Finally, the long-awaited update on the Grand Egyptian Museum is here! Join me in the 38th episode of the Egypt Travel Podcast for an in-depth exploration of the latest updates and an exclusive sneak peek into the limited trial visits program.\" \n\n2. \"Curious about what's available to see and what's off-limits at the Grand Egyptian Museum? I've got you covered! Tune in to the Egypt Travel Podcast for detailed information on the treasures waiting to be discovered during these trial visits.\"\n\n3. \"Attention all Egypt enthusiasts! Learn how to grab tickets to the Grand Egyptian Museum before it opens to the public. Don't miss my latest episode, where I share insider tips and estimates on when this monumental event might occur.\"\n\n4. \"Exciting news - the Egypt Travel Podcast has gone visual! Join me on my new YouTube channel, 'Dreaming of Egypt,' for a captivating video episode featuring all the juicy updates on the Grand Egyptian Museum. Subscribe now and hit that bell icon for automatic notifications.\"\n\n5. \"Get ready to venture behind the scenes of an Egyptian tour operator's life with my upcoming show on 'Dreaming of Egypt.' Wondering what it takes to run a tour operator on the ground in Egypt? Stay tuned for more details, coming soon!\"\n\n6. \"Calling all history buffs and travel lovers! Discover the latest spring and summer updates on the Grand Egyptian Museum in my captivating video episode on the Egypt Travel and Culture Channel. Search 'Dreaming of Egypt' or 'John Navar' to find the episode and subscribe for more exciting content.\"\n\n7. \"Join me on the Egypt Travel and Culture Channel as I unveil the May/June 2023 updates on the Grand Egyptian Museum. From fascinating insights to practical information, this video podcast episode is a must-watch for all Egypt enthusiasts. Don't miss out!\"\n\n8. \"Ready for an immersive experience into the wonders of Egypt? Head over to youtube.com/atDreamingofEgypt and dive into the latest video podcast episode of the Egypt Travel Podcast. Get ready for an adventure like no other with your host, John Navar.\"\n\n9. \"Unlock the secrets of the Grand Egyptian Museum with a captivating video episode on the Egypt Travel and Culture Channel. From hidden treasures to upcoming events, this episode is a treasure trove of fascinating updates you won't want to miss!\"\n\n10. \"Subscribe to the Egypt Travel and Culture Channel on YouTube and be the first to explore the enchanting world of Egypt. From must-visit destinations to insider tips, this channel is your ticket to a memorable journey. Join us now and let the adventure begin!\""}